Series -> data contained in one column
DataFrame -> data contained in ,multiple columns (2d data)

Creation of DataFrames

In [1]:
import pandas as pd
data = {"Name":["john","peter","lisa"],
        "Age":[24,25,26],
        "Salary":[50000,45000,60000]}
df=pd.DataFrame(data)
print(df)

    Name  Age  Salary
0   john   24   50000
1  peter   25   45000
2   lisa   26   60000

In [23]:
data = pd.read_csv("annual.csv")
print(data)

       Year Industry_aggregation_NZSIOC Industry_code_NZSIOC  \
0      2023                     Level 1                99999
1      2023                     Level 1                99999
2      2023                     Level 1                99999
3      2023                     Level 1                99999
4      2023                     Level 1                99999
...     ...                         ...                  ...
50980  2013                     Level 3                 ZZ11
50981  2013                     Level 3                 ZZ11
50982  2013                     Level 3                 ZZ11
50983  2013                     Level 3                 ZZ11
50984  2013                     Level 3                 ZZ11

             Industry_name_NZSIOC               Units Variable_code  \
0                  All industries  Dollars (millions)           H01
1                  All industries  Dollars (millions)           H04
2                  All industries  Dollars (millions)           H05
3                  All industries  Dollars (millions)           H07
4                  All industries  Dollars (millions)           H08
...                           ...                 ...           ...
50980  Food product manufacturing          Percentage           H37
50981  Food product manufacturing          Percentage           H38
50982  Food product manufacturing          Percentage           H39
50983  Food product manufacturing          Percentage           H40
50984  Food product manufacturing          Percentage           H41

                                         Variable_name      Variable_category  \
0                                         Total income  Financial performance
1      Sales, government funding, grants and subsidies  Financial performance
2                    Interest, dividends and donations  Financial performance
3                                 Non-operating income  Financial performance
4                                    Total expenditure  Financial performance
...                                                ...                    ...
50980                                      Quick ratio       Financial ratios
50981              Margin on sales of goods for resale       Financial ratios
50982                                 Return on equity       Financial ratios
50983                           Return on total assets       Financial ratios
50984                            Liabilities structure       Financial ratios

        Value                             Industry_code_ANZSIC06
0      930995  ANZSIC06 divisions A-S (excluding classes K633...
1      821630  ANZSIC06 divisions A-S (excluding classes K633...
2       84354  ANZSIC06 divisions A-S (excluding classes K633...
3       25010  ANZSIC06 divisions A-S (excluding classes K633...
4      832964  ANZSIC06 divisions A-S (excluding classes K633...
...       ...                                                ...
50980      52  ANZSIC06 groups C111, C112, C113, C114, C115, ...
50981      40  ANZSIC06 groups C111, C112, C113, C114, C115, ...
50982      12  ANZSIC06 groups C111, C112, C113, C114, C115, ...
50983       5  ANZSIC06 groups C111, C112, C113, C114, C115, ...
50984      46  ANZSIC06 groups C111, C112, C113, C114, C115, ...

[50985 rows x 10 columns]

In [24]:
data = pd.read_excel("E:/DSA_ML/test.xlsx")
print(data)

FileNotFoundError: [Errno 2] No such file or directory: 'E:/DSA_ML/test.xlsx'

Exploring Data in Pandas

In [4]:
import pandas as pd
data = pd.read_excel("ESD.xlsx")
# print(data)
# by default head and tail value is 5
# print(data.head(10))    #shows 1st 10 data
print(data.tail(10))    #shows last 10 data

       EEID          Full Name             Job Title       Department  \
990  E01578       Anthony Hong            Sr. Manger               IT
991  E03430        Leo Herrera  Sr. Business Partner  Human Resources
992  E03058      Robert Wright   Technical Architect               IT
993  E04762  Audrey Richardson              Director               IT
994  E01148     Scarlett Kumar       Systems Analyst               IT
995  E03094       Wesley Young           Sr. Analyst        Marketing
996  E01909       Lillian Khan               Analyst          Finance
997  E04398        Oliver Yang              Director        Marketing
998  E02521        Lily Nguyen           Sr. Analyst          Finance
999  E03545        Sofia Cheng        Vice President       Accounting

              Business Unit  Gender  Ethnicity  Age  Hire Date  Annual Salary  \
990  Research & Development    Male      Asian   37 2010-11-29         146961
991  Research & Development    Male     Latino   48 1998-04-22          85369
992           Manufacturing    Male  Caucasian   30 2015-06-14          67489
993           Manufacturing  Female  Caucasian   46 2018-10-06         166259
994               Corporate  Female      Asian   55 2009-01-07          47032
995     Speciality Products    Male  Caucasian   33 2016-09-18          98427
996     Speciality Products  Female      Asian   44 2010-05-31          47387
997     Speciality Products    Male      Asian   31 2019-06-10         176710
998     Speciality Products  Female      Asian   33 2012-01-28          95960
999               Corporate  Female      Asian   63 2020-07-26         216195

     Bonus %        Country      City  Exit Date
990     0.11  United States  Columbus        NaT
991     0.00         Brazil    Manaus 2004-11-27
992     0.00  United States   Chicago        NaT
993     0.17  United States   Chicago        NaT
994     0.00  United States  Columbus        NaT
995     0.00  United States  Columbus        NaT
996     0.00          China   Chengdu 2018-01-08
997     0.15  United States     Miami        NaT
998     0.00          China   Chengdu        NaT
999     0.31  United States     Miami        NaT

In [5]:
print(data.info()) #gives data type , informations about dta

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 14 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   EEID           1000 non-null   object
 1   Full Name      1000 non-null   object
 2   Job Title      1000 non-null   object
 3   Department     1000 non-null   object
 4   Business Unit  1000 non-null   object
 5   Gender         1000 non-null   object
 6   Ethnicity      1000 non-null   object
 7   Age            1000 non-null   int64
 8   Hire Date      1000 non-null   datetime64[ns]
 9   Annual Salary  1000 non-null   int64
 10  Bonus %        1000 non-null   float64
 11  Country        1000 non-null   object
 12  City           1000 non-null   object
 13  Exit Date      85 non-null     datetime64[ns]
dtypes: datetime64[ns](2), float64(1), int64(2), object(9)
memory usage: 109.5+ KB
None

In [6]:
data.describe() #gives the numarical columns (which have integer/float values)

               Age  Annual Salary      Bonus %
count  1000.000000    1000.000000  1000.000000
mean     44.382000  113217.365000     0.088660
std      11.246981   53545.985644     0.117856
min      25.000000   40063.000000     0.000000
25%      35.000000   71430.250000     0.000000
50%      45.000000   96557.000000     0.000000
75%      54.000000  150782.250000     0.150000
max      65.000000  258498.000000     0.400000

In [7]:
#null values 
# print(data.isnull())
#how many null values do we have
print(data.isnull().sum())

EEID               0
Full Name          0
Job Title          0
Department         0
Business Unit      0
Gender             0
Ethnicity          0
Age                0
Hire Date          0
Annual Salary      0
Bonus %            0
Country            0
City               0
Exit Date        915
dtype: int64

Handeling Duplicate values in pandas

In [29]:
import pandas as pd
data=pd.read_csv("company1.csv")
print(data)

    EEID      Name gender   salary
0  EMP01    ayushi      F      NaN
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M      NaN
6  EMP02     rohit      M  25000.0

In [30]:
#duplicate values must be present in unique rows(here EEID)
print(data.duplicated("EEID"))    #swhows duplicate values
# print(data["EEID"].duplicated().sum())  #shows no. of duplicates

0    False
1    False
2    False
3     True
4    False
5    False
6     True
dtype: bool

In [31]:
print(data.drop_duplicates("EEID"))   #delete duplicates

    EEID      Name gender   salary
0  EMP01    ayushi      F      NaN
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M      NaN

Working with missing data / Null values

In [9]:
import pandas as pd
data=pd.read_csv("company1.csv")
print(data)

    EEID      Name gender   salary
0  EMP01    ayushi      F      NaN
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M      NaN
6  EMP02     rohit      M  25000.0

In [10]:
print(data.isnull().sum())

EEID      0
Name      1
gender    1
salary    2
dtype: int64

In [11]:
# dropna deletes the entire row containg value null, it is problem
print(data.dropna())

    EEID    Name gender   salary
1  EMP02   rohit      M  25000.0
3  EMP01  ayushi      F  20000.0
6  EMP02   rohit      M  25000.0

In [14]:
import numpy as np
# we can replace by any string or value but it makes no sense as age can't be any value or name salary can't be string
print(data.replace(np.NaN,"hii"))

    EEID      Name gender   salary
0  EMP01    ayushi      F      hii
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    hii  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05       hii      M  25000.0
5  EMP06     rohit      M      hii
6  EMP02     rohit      M  25000.0

In [15]:
#it is preffereable to drop null vallues individual
#for salry we should replace null values with its original mean values , thus after droping the mean value remains same
print(data["salary"].mean())
data["salary"]=data["salary"].replace(np.NaN,24400)
print(data)
print(data["salary"].mean())

24400.0
    EEID      Name gender   salary
0  EMP01    ayushi      F  24400.0
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M  24400.0
6  EMP02     rohit      M  25000.0
24400.0

In [20]:
print(data)

    EEID      Name gender   salary
0  EMP01    ayushi      F  24400.0
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M  24400.0
6  EMP02     rohit      M  25000.0

In [32]:
#fills forward the previous value to its next nulll value
# print(data.fillna(method = "ffill"))

#fills backward the next value to its previous nulll value
print(data.fillna(method = "bfill"))

#fills all null values with whatever we write here
# print(data.fillna("hiii"))   #same as print(data.replace(np.nan,"hii"))

    EEID      Name gender   salary
0  EMP01    ayushi      F  25000.0
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali      F  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05     rohit      M  25000.0
5  EMP06     rohit      M  25000.0
6  EMP02     rohit      M  25000.0

Column Transformation Part-1

In [54]:
import pandas as pd
df=pd.read_csv("company1.csv")
# print(df)

# creates a column and work on data
df.loc[(df["salary"] == 25000),"sallii"]="income handsome"  #loc->lock 
df.loc[(df["salary"] > 25000),"sallii"]="income prime"
print(df.head())

    EEID      Name gender   salary           sallii
0  EMP01    ayushi      F      NaN              NaN
1  EMP02     rohit      M  25000.0  income handsome
2  EMP03  pranjali    NaN  27000.0     income prime
3  EMP01    ayushi      F  20000.0              NaN
4  EMP05       NaN      M  25000.0  income handsome

In [55]:
# creates new column taking more than 1 column
df["info"] = df["Name"].str.capitalize() + " " + df["gender"]
print(df)

    EEID      Name gender   salary      info
0  EMP01    ayushi      F      NaN  Ayushi F
1  EMP02     rohit      M  25000.0   Rohit M
2  EMP03  pranjali    NaN  27000.0       NaN
3  EMP01    ayushi      F  20000.0  Ayushi F
4  EMP05       NaN      M  25000.0       NaN
5  EMP06     rohit      M      NaN   Rohit M
6  EMP02     rohit      M  25000.0   Rohit M

Column Transformation Part-2

In [57]:
import pandas as pd
df=pd.read_csv("company1.csv")
# print(df)

#we can perform any mathematical operations
df["salary"]=(df["salary"]/100)*20
print(df)

    EEID      Name gender  salary
0  EMP01    ayushi      F     NaN
1  EMP02     rohit      M  5000.0
2  EMP03  pranjali    NaN  5400.0
3  EMP01    ayushi      F  4000.0
4  EMP05       NaN      M  5000.0
5  EMP06     rohit      M     NaN
6  EMP02     rohit      M  5000.0

In [60]:
data={"Months":["January","February","March","April","May"]}
a=pd.DataFrame(data)
# print(a)

# map function used to create new column and extracts the data we want
def extract(value):
    return value[0:3]
a["shorts"]=a["Months"].map(extract)
print(a)

     Months shorts
0   January    Jan
1  February    Feb
2     March    Mar
3     April    Apr
4       May    May

Pandas GroupBY

In [68]:
import pandas as pd
data=pd.read_excel("ESD.xlsx")
# number of employees group by department(1-level of group by)
# gp = data.groupby("Department").agg({"EEID":"count"})
# number of employees group by department and gender (2-level of group by)
gp = data.groupby(["Department","Gender"]).agg({"EEID":"count"})
print(gp)

                        EEID
Department      Gender
Accounting      Female    53
                Male      43
Engineering     Female    80
                Male      78
Finance         Female    69
                Male      51
Human Resources Female    64
                Male      61
IT              Female   119
                Male     122
Marketing       Female    57
                Male      63
Sales           Female    76
                Male      64

In [82]:
# gp1=data.groupby("Country").agg({"Age":"mean"})
#max salary group by country

# gp1=data.groupby("Country").agg({"Annual Salary":"max"})
#max salary,max age group by country,gender

gp1=data.groupby(["Country","Gender"]).agg({"Annual Salary":"max","Age":"min"})
print(gp1)

                      Annual Salary  Age
Country       Gender
Brazil        Female         258426   25
              Male           249506   26
China         Female         249686   25
              Male           257194   25
United States Female         258498   25
              Male           258081   25

Pandas Merge , Join , Concatenate

In [36]:
#Merge

import pandas as pd
data1 = {"Emp Id":["E01","E02","E03","E04","E05","E06"],
         "Names":["Ram","Shyam","Rahul","Vishal","Ravi","John"],
         "Age":[34,56,23,44,32,36]}
data2 = {"Emp Id":["E01","E02","E07","E04","E05","E08"],
         "Salary":[45000,56000,34000,30000,50000,36000]}
df1=pd.DataFrame(data1)
df2=pd.DataFrame(data2)
print(df1)
print()
print(df2)

  Emp Id   Names  Age
0    E01     Ram   34
1    E02   Shyam   56
2    E03   Rahul   23
3    E04  Vishal   44
4    E05    Ravi   32
5    E06    John   36

  Emp Id  Salary
0    E01   45000
1    E02   56000
2    E07   34000
3    E04   30000
4    E05   50000
5    E08   36000

In [39]:
#join on the basis of common data between tables
print(pd.merge(df1,df2,on = "Emp Id")) #by default it has inner join

  Emp Id   Names  Age  Salary
0    E01     Ram   34   45000
1    E02   Shyam   56   56000
2    E04  Vishal   44   30000
3    E05    Ravi   32   50000

In [40]:
#join on the basis of left table
print(pd.merge(left=df1,right=df2,on = "Emp Id", how="left")) #left outer join

  Emp Id   Names  Age   Salary
0    E01     Ram   34  45000.0
1    E02   Shyam   56  56000.0
2    E03   Rahul   23      NaN
3    E04  Vishal   44  30000.0
4    E05    Ravi   32  50000.0
5    E06    John   36      NaN

In [41]:
#join on the basis of right table
print(pd.merge(left=df1,right=df2,on = "Emp Id", how="right")) #right outer join

  Emp Id   Names   Age  Salary
0    E01     Ram  34.0   45000
1    E02   Shyam  56.0   56000
2    E07     NaN   NaN   34000
3    E04  Vishal  44.0   30000
4    E05    Ravi  32.0   50000
5    E08     NaN   NaN   36000

In [42]:
data1 = {"Emp Id":["E01","E02","E03","E04","E05","E06"],
         "Names":["Ram","Shyam","Rahul","Vishal","Ravi","John"],
         "Age":[34,56,23,44,32,36]}

In [44]:
#Concatenate

data1 = {"Emp Id":["E01","E02","E03","E04","E05","E06"],
         "Names":["Ram","Shyam","Rahul","Vishal","Ravi","John"],
         "Age":[34,56,23,44,32,36]}
data2 = {"Emp Id":["E07","E08","E09","E10","E11","E12"],
         "Names":["Prasenjit","Sumit","Rahul","Ankit","Sayan","Akash"],
         "Age":[34,56,23,44,32,36]}
df1=pd.DataFrame(data1)
df2=pd.DataFrame(data2)
print(pd.concat([df1,df2]))

  Emp Id      Names  Age
0    E01        Ram   34
1    E02      Shyam   56
2    E03      Rahul   23
3    E04     Vishal   44
4    E05       Ravi   32
5    E06       John   36
0    E07  Prasenjit   34
1    E08      Sumit   56
2    E09      Rahul   23
3    E10      Ankit   44
4    E11      Sayan   32
5    E12      Akash   36

Compare Pandas

In [54]:
import pandas as pd
dict={"Fruits":["Mango","apples","banana","papaya"],
      "Price":[120,200,80,150],
      "Quantity":[10,15,20,8]}
df1=pd.DataFrame(dict)
print(df1)

#copy df1 data into df2
df2=df1.copy()
# print(df2)
df2.loc[0,"Price"]=60
df2.loc[1,"Price"]=130
df2.loc[3,"Price"]=100
df2.loc[0,"Quantity"]=20
df2.loc[1,"Quantity"]=12
df2.loc[3,"Quantity"]=15
print(df2)

#to see the differece ,we use compare

#shows only the datas which are alterded
# print(df1.compare(df2))   #by default here axis=1
# print(df1.compare(df2,align_axis=0))   

#shows all the datas which are alterded as well as not altered
# print(df1.compare(df2,keep_shape=True))  #NaN means no change
print(df1.compare(df2,keep_shape=False))   # same as print(df1.compare(df2))

   Fruits  Price  Quantity
0   Mango    120        10
1  apples    200        15
2  banana     80        20
3  papaya    150         8
   Fruits  Price  Quantity
0   Mango     60        20
1  apples    130        12
2  banana     80        20
3  papaya    100        15
   Price        Quantity
    self  other     self other
0  120.0   60.0     10.0  20.0
1  200.0  130.0     15.0  12.0
3  150.0  100.0      8.0  15.0

Pivoting , Melting

In [11]:
#Pivoting

import pandas as pd
dict={"Keys":["k1","k2","k1","k2"],
      "names":["John","Ben","David","Petre"],
      "Houses":["red","blue","green","red"],
      "Grades":["3rd","8th","9th","8th"]}
df=pd.DataFrame(dict)
print(df)

#pivot for single data
# print(df.pivot(index="Keys",columns="names",values="Houses"))   #(index,columns,values)
#pivot for multiple data
print(df.pivot(index="Keys",columns="names",values=["Houses","Grades"]))

  Keys  names Houses Grades
0   k1   John    red    3rd
1   k2    Ben   blue    8th
2   k1  David  green    9th
3   k2  Petre    red    8th
      Houses                   Grades
names    Ben  David John Petre    Ben David John Petre
Keys
k1       NaN  green  red   NaN    NaN   9th  3rd   NaN
k2      blue    NaN  NaN   red    8th   NaN  NaN   8th

In [20]:
#Melting

dict={"Names":["John","Ben","David","Petre"],
      "Houses":["red","blue","green","red"],
      "Grades":["3rd","8th","9th","8th"]}
df=pd.DataFrame(dict)
print(df)

#convering columns as data and values

#for single variables
# print(pd.melt ( df, id_vars=["Names"], value_vars=["Houses"] ))   
#for multiple variables
# print(pd.melt ( df, id_vars=["Names"], value_vars=["Houses","Grades"] ))

#to rename the columns
print(pd.melt ( df, id_vars=["Names"], value_vars=["Houses","Grades"], var_name="Houses&Grades", value_name="results" ))

   Names Houses Grades
0   John    red    3rd
1    Ben   blue    8th
2  David  green    9th
3  Petre    red    8th
   Names Houses&Grades results
0   John        Houses     red
1    Ben        Houses    blue
2  David        Houses   green
3  Petre        Houses     red
4   John        Grades     3rd
5    Ben        Grades     8th
6  David        Grades     9th
7  Petre        Grades     8th